MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_opamp.c
  * @brief   OPAMP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the operational amplifier(s) peripheral:
  *           + Initialization and de-initialization functions
  *           + Input and output operation functions
  *           + Peripheral Control functions
  *           + Peripheral state functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (OPAMP1) || defined (OPAMP2) || defined(OPAMP3)
#if defined(USE_HAL_OPAMP_MODULE) && (USE_HAL_OPAMP_MODULE == 1)

/** @addtogroup OPAMP
  * @{
  */

/** @defgroup OPAMP_Introduction OPAMP Introduction
  * @{

  - The OPAMP (Operational Amplifier) hardware abstraction layer provides a set of APIs to interface with the STM32
    operational amplifier peripheral.
  - It simplifies the initialization, configuration and process of peripheral features
  - This abstraction layer ensures portability and ease of use across different STM32 series.

  The HAL OPAMP driver includes the following features:
   - Support for multiple OPAMP modes: stand-alone, follower, inverting and non-inverting PGA
   - Programmable gain settings with internal or external filtering/bias
   - Timer-controlled operation for dynamic reconfiguration

  */
/**
  * @}
  */

/** @defgroup OPAMP_How_To_Use OPAMP How To Use
  * @{

  # OPAMP peripheral main features

  ## OPAMP instances

   The C5 device integrates three operational amplifiers: OPAMP1 & OPAMP2 & OPAMP3 (1)
   (1) OPAMP2 & OPAMP3 availability depends on the device

  ## OPAMP configuration mode

    The OPAMP provide(s) several exclusive configuration modes.
    - Standalone mode
    - Programmable Gain Amplifier (PGA) mode, with or without external filtering (A capacitor can be connected between
      OPAMP output and inverting input for filtering purpose, refer to reference manual)
    - Follower mode

  ## OPAMP power mode

    Each OPAMP instance can be configured in normal-power or low-power mode.

  ## OPAMP speed mode

    Each OPAMP instance can be configured in normal speed or high speed.


  ## OPAMP calibration feature

    The OPAMP provide(s) calibration capabilities.
    - Calibration aims at improving voltage offset accuracy
    - The OPAMP uses either factory calibration settings or user defined
        calibration settings (i.e. trimming mode).
    - The user trimming values can be figured out by calling calibration
        handled by HAL_OPAMP_Calibrate().
    - HAL_OPAMP_Calibrate()
      - Run automatically the calibration.
      - Enables the user trimming mode.
      - Updates the trimming registers values with fresh calibration results.
         The user might store the calibration results for latter usage
         (for example, monitoring the trimming based on temperature).
    - HAL_OPAMP_CalibrateParallel()
      -  Run calibration in parallel for linked HAL OPAMP handles to speed up calibration processing time.

  ## OPAMP configuration mode:
    ### Standalone mode
    - OPAMP input and output are not internally connected.
      User can implement any circuitry using external components.

    ### Follower mode
    - Inverting Input is connected internally, no external connection on inverting input.

    ### Programmable Gain Amplifier (PGA) mode (Resistor feedback output)

    - The OPAMP output(s) is internally connected to resistor feedback.
    - OPAMP internal programmable gain is either x2, x4, x8 or x16.
      Two usages:
        - inverting output not used, only programmable gain.
        - inverting input used for external filtering coupled with programmable gain
          (ex: connected capacitor for low-pass filtering).

  ## The OPAMPs inverting input
     The OPAMPs inverting input can be selected according to the Reference Manual
        "OPAMP functional description" chapter.

  ## The OPAMPs non-inverting input
     The OPAMPs non-inverting input can be selected according to the Reference Manual
        "OPAMP functional description" chapter.

  # How to use HAL OPAMP module driver

  ## The OPAMP HAL driver can be used as follows:

  ### How to initialize the OPAMP low level resources:
    - OPAMP bus clock must be enabled to get read and write access to OPAMP registers.

      @note  clock is enabled inside HAL_OPAMP_Init() whenever USE_HAL_OPAMP_CLK_ENABLE_MODEL is not set
             to HAL_CLK_ENABLE_NO.
    - Configure the OPAMP input pins and output pin in analog mode using
      HAL_GPIO_Init() to map the OPAMP output to the GPIO pin.
    - Declare a hal_opamp_handle_t handle structure.
    - Initialize OPAMP instance using HAL_OPAMP_Init().
    - Configure the OPAMP instance with HAL_OPAMP_SetConfig() function.
    - Select the inverting input and the non-inverting input using HAL_OPAMP_SetConfigInputConnection()
    - By default factory trimming is set, else,
      call HAL_OPAMP_Calibrate() or HAL_OPAMP_SetConfigTrimming() functions to use "user trimming" mode
      with the user PMOS and NMOS trimming values.

  ### How to start and stop the OPAMP instances:
    - Start the OPAMP instance using HAL_OPAMP_Start() function.
    - Stop the OPAMP instance using HAL_OPAMP_Stop() function.

  ## Operational amplifier possible pin connections:
    - Cf Reference Manual
  */
/**
  * @}
  */

