MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
/** @defgroup OPAMP_Configuration_Table OPAMP Configuration Table
  * @{
# Configuration inside the OPAMP driver

  Config defines                | Description           | Default value | Note                                     |
--------------------------------| ----------------------| ------------- | ------------------------------------------
USE_HAL_OPAMP_MODULE            | from hal_conf.h       | 1 | When set, HAL OPAMP module is enabled
USE_HAL_OPAMP_CALIBRATE_PARALLEL| from hal_conf.h       | 0 | Enable the parallel calibration
USE_HAL_OPAMP_USER_DATA         | from hal_conf.h       | 0 | Enable the user data
USE_HAL_OPAMP_CLK_ENABLE_MODEL  | from hal_conf.h       | HAL_CLK_ENABLE_NO | Periph. clock gating in HAL_OPAMP_Init()
USE_HAL_CHECK_PARAM             | from hal_conf.h       | 0  | Parameters (pointers or sizes) are checked in runtime
USE_HAL_CHECK_PROCESS_STATE     | from hal_conf.h       | 0  | When set, enable atomic access to process state check
USE_ASSERT_DBG_PARAM            | from PreProcessor env | None | When defined, enable the params assert
USE_ASSERT_DBG_STATE            | from PreProcessor env | None | When defined, enable the state assert
  */
/**
  * @}
  */

/* Private typedef -----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup OPAMP_Private_Constants OPAMP Private Constants
  * @brief   OPAMP Private constants and defines
  * @{
  */
#define OPAMP_STATE_ALL (((uint32_t) HAL_OPAMP_STATE_IDLE)  \
                         | ((uint32_t) HAL_OPAMP_STATE_ACTIVE))  /*!< OPAMP all states except RESET and CALIB */

/* Offset trimming time: during calibration, minimum time needed between two  */
/* steps to have 1 mV accuracy.                                               */
/* The CALOUT flag needs up to 1 ms after the trimming value is changed to become steady */
/* Unit: ms.                                                                  */
#define OPAMP_TRIMMING_DELAY_MS      ((uint32_t) 1U)  /*!< Trimming delay in milli-seconds */

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup OPAMP_Private_Macros OPAMP Private Macros
  * @{
  */

/*! Retrieve OPAMP instance from handle */
#define OPAMP_GET_INSTANCE(hopamp) ((OPAMP_TypeDef *)((uint32_t)((hopamp)->instance)))

/*! Check configuration mode */
#define IS_OPAMP_CONFIGURATION_MODE(mode) (((mode) == HAL_OPAMP_MODE_STANDALONE) \
                                           || ((mode) == HAL_OPAMP_MODE_PGA) \
                                           || ((mode) == HAL_OPAMP_MODE_FOLLOWER))

/*! Check non-inverting input for STANDALONE, FOLLOWER, or PGA */
#define IS_OPAMP_NON_INVERTING_INPUT(input) (((input) ==  HAL_OPAMP_NON_INVERTING_INPUT_GPIO_0) \
                                             || ((input) ==  HAL_OPAMP_NON_INVERTING_INPUT_GPIO_1) \
                                             || ((input) ==  HAL_OPAMP_NON_INVERTING_INPUT_GPIO_2) \
                                             || ((input) ==  HAL_OPAMP_NON_INVERTING_INPUT_DAC1_CH2))

/*! Check inverting input */
#define IS_OPAMP_INVERTING_INPUT(input) (((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_0)  \
                                         || ((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_1)  \
                                         || ((input) ==  HAL_OPAMP_INVERTING_INPUT_INT ))

/*! Check inverting input for standalone configuration */
#define IS_OPAMP_INVERTING_INPUT_STANDALONE(input)  (((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_0)  \
                                                     || ((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_1))

/*! Check inverting input for follower configuration */
#define IS_OPAMP_INVERTING_INPUT_FOLLOWER(input) ((input) ==  HAL_OPAMP_INVERTING_INPUT_INT)

/*! Check inverting input for PGA configuration */
#define IS_OPAMP_INVERTING_INPUT_PGA(input)  (((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_0)  \
                                              || ((input) ==  HAL_OPAMP_INVERTING_INPUT_GPIO_1)  \
                                              || ((input) ==  HAL_OPAMP_INVERTING_INPUT_INT))

/*! Check PGA gain */
#define IS_OPAMP_PGA_GAIN(gain) (((gain) == HAL_OPAMP_PGA_GAIN_2) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_4) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_8) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_16) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_2_OR_MINUS_1) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_4_OR_MINUS_3) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_8_OR_MINUS_7) \
                                 || ((gain) == HAL_OPAMP_PGA_GAIN_16_OR_MINUS_15))

/*! Check power mode */
#define IS_OPAMP_POWER_MODE(power_mode) ((power_mode) == HAL_OPAMP_POWER_MODE_NORMAL)

/*! Check speed mode */
#define IS_OPAMP_SPEED_MODE(speed_mode) (((speed_mode) == HAL_OPAMP_SPEED_MODE_NORMAL) \
                                         || ((speed_mode) == HAL_OPAMP_SPEED_MODE_HIGH))

/*! Check trimming mode */
#define IS_OPAMP_TRIMMING_MODE(trimming_mode) (((trimming_mode) == HAL_OPAMP_TRIMMING_FACTORY) \
                                               || ((trimming_mode) == HAL_OPAMP_TRIMMING_USER))

/*! Check trimming value */
#define IS_OPAMP_TRIMMING_VALUE(trimming_value) (((trimming_value) >= 1U) && ((trimming_value) <= 31U))

/*! Check PGA external mode */
#define IS_OPAMP_PGA_EXTERNAL_MODE(external_mode)   (((external_mode) == HAL_OPAMP_PGA_EXT_NONE) \
                                                     || ((external_mode) == HAL_OPAMP_PGA_EXT_FILT) \
                                                     || ((external_mode) == HAL_OPAMP_PGA_EXT_BIAS) \
                                                     || ((external_mode) == HAL_OPAMP_PGA_EXT_BIAS_FILT))
/*! Check inputs multiplexer mode */
#define IS_OPAMP_MUX_INPUT_CTRL(mux_inputs_ctrl) (((mux_inputs_ctrl) == HAL_OPAMP_MUX_INPUT_CTRL_DISABLE) \
                                                  || ((mux_inputs_ctrl) == HAL_OPAMP_MUX_INPUT_CTRL_TIM1_OC6) \
                                                  || ((mux_inputs_ctrl) == HAL_OPAMP_MUX_INPUT_CTRL_TIM2_OC4) \
                                                  || ((mux_inputs_ctrl) == HAL_OPAMP_MUX_INPUT_CTRL_TIM12_OC1) \
                                                  || ((mux_inputs_ctrl) == HAL_OPAMP_MUX_INPUT_CTRL_TIM15_OC2))
/*! Check multiplexer PGA mode */
#define IS_OPAMP_MUX_PGA_GAIN_CTRL(mux_pga_ctrl) (((mux_pga_ctrl) == HAL_OPAMP_MUX_PGA_GAIN_CTRL_DISABLE) \
                                                  || ((mux_pga_ctrl) == HAL_OPAMP_MUX_PGA_GAIN_CTRL_TIM1_OC6)  \
                                                  || ((mux_pga_ctrl) == HAL_OPAMP_MUX_PGA_GAIN_CTRL_TIM2_OC4)  \
                                                  || ((mux_pga_ctrl) == HAL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC2) \
                                                  || ((mux_pga_ctrl) == HAL_OPAMP_MUX_PGA_GAIN_CTRL_TIM15_OC2))

