MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
/*! Check output connection */
#define IS_OPAMP_OUT_CONNECTION(connect) (((connect) == HAL_OPAMP_OUTPUT_CONNECTION_EXTERNAL) \
                                          || ((connect) == HAL_OPAMP_OUTPUT_CONNECTION_INTERNAL))
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @addtogroup OPAMP_Private_Variables OPAMP Private Variables
  * @{
  */

/**
  * @}
  */

/* Private functions prototypes ---------------------------------------------------------*/
/** @defgroup OPAMP_Private_Functions OPAMP Private Functions
  * @{
  */
static void OPAMP_CalibrateSingle(hal_opamp_handle_t *hopamp, hal_opamp_power_mode_t power_mode);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup OPAMP_Exported_Functions HAL OPAMP Functions
  * @{
  */

/** @addtogroup OPAMP_Exported_Functions_Group1
  * @{
    This section provides functions allowing to:
      + initialize the OPAMP,
      + de-initialize the OPAMP,
      + configure the OPAMP,
      + calibration setting.
  */

/**
  * @brief  Initializes the OPAMP according to the specified
  *         parameters in the hal_opamp_config_t and initialize the associated handle.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  instance A OPAMP hardware peripheral base address.
  * @note   After calling this function the OPAMP jump to HAL_OPAMP_STATE_IDLE, and it is possible
  *         to call directly HAL_OPAMP_Start() without calling HAL_OPAMP_SetConfig().\n
  *         The OPAMP default configuration parameters are:
  *         + OPAMP is disabled
  *         + normal mode operation (i.e.: not in calibration mode)
  *         + normal power mode
  *         + normal speed mode
  *         + standalone configuration
  *         + PGA gain x2
  *         + GPIO connected to non-inverting input
  *         + GPIO connected to inverting input
  * @retval HAL_OK OPAMP Instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_OPAMP_Init(hal_opamp_handle_t *hopamp, hal_opamp_t instance)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_PARAM(IS_OPAMP_ALL_INSTANCE((OPAMP_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hopamp == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hopamp->instance = instance;

#if defined(USE_HAL_OPAMP_USER_DATA) && (USE_HAL_OPAMP_USER_DATA == 1)
  hopamp->p_user_data = NULL;
#endif /* USE_HAL_OPAMP_USER_DATA */

#if defined(USE_HAL_OPAMP_CLK_ENABLE_MODEL) && (USE_HAL_OPAMP_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable kernel clock */
  switch (instance)
  {
    case HAL_OPAMP1:
      HAL_RCC_OPAMP1_EnableClock();
      break;
#if defined(OPAMP2)
    case HAL_OPAMP2:
      HAL_RCC_OPAMP2_EnableClock();
      break;
#endif /* OPAMP2 */
#if defined(OPAMP3)
    case HAL_OPAMP3:
      HAL_RCC_OPAMP3_EnableClock();
      break;
#endif /* OPAMP3 */
    default:
      break;
  }
#endif /* USE_HAL_OPAMP_CLK_ENABLE_MODEL */

  hopamp->global_state = HAL_OPAMP_STATE_IDLE;

  return status;
}

/**
  * @brief  DeInitialize the OPAMP peripheral.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @note   Stop the OPAMP and restore the state machine to reset state.
  */
void HAL_OPAMP_DeInit(hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  ASSERT_DBG_PARAM(IS_OPAMP_ALL_INSTANCE(p_instance));

#if defined (USE_HAL_OPAMP_USER_DATA) && (USE_HAL_OPAMP_USER_DATA == 1)
  hopamp->p_user_data = NULL;
#endif /* USE_HAL_OPAMP_USER_DATA */

  /* OPAMP must be disabled first separately */
  LL_OPAMP_Disable(p_instance);  /* OPAMP must be disabled first separately */

  /* Then set OPAMP_CSR register to reset value */
  /* Mind that CSR RANGE bit of OPAMP1 remains unchanged (applies to both OPAMPs) */
  LL_OPAMP_ResetConfig(p_instance);

  hopamp->global_state = HAL_OPAMP_STATE_RESET;
}

/**
  * @brief  Configure the OPAMP peripheral according to the specified parameters in the hal_opamp_config_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config  The configuration that contains information for the specified OPAMP.
  * @retval HAL_OK OPAMP Instance has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL
  */
hal_status_t HAL_OPAMP_SetConfig(hal_opamp_handle_t *hopamp, const hal_opamp_config_t *p_config)
{
  OPAMP_TypeDef *p_instance;
  uint32_t inverting_input;
  uint32_t non_inverting_input;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_PARAM(IS_OPAMP_SPEED_MODE(p_config->speed_mode));
  ASSERT_DBG_PARAM(IS_OPAMP_CONFIGURATION_MODE(p_config->configuration_mode));
  ASSERT_DBG_PARAM(IS_OPAMP_OUT_CONNECTION(p_config->opamp_output));

  ASSERT_DBG_STATE(hopamp->global_state, HAL_OPAMP_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* Set OPAMP input connections according to the configuration mode */
  switch (p_config->configuration_mode)
  {
    case HAL_OPAMP_MODE_PGA:
      inverting_input         = LL_OPAMP_INPUT_INVERT_INT_PGA;
      non_inverting_input     = LL_OPAMP_INPUT_NONINVERT_IO0;
      break;

    case HAL_OPAMP_MODE_FOLLOWER:
      inverting_input         = LL_OPAMP_INPUT_INVERT_INT_FOLLOWER;
      non_inverting_input     = LL_OPAMP_INPUT_NONINVERT_IO0;
      break;

    case HAL_OPAMP_MODE_STANDALONE:
    default:
      inverting_input         = LL_OPAMP_INPUT_INVERT_IO0;
      non_inverting_input     = LL_OPAMP_INPUT_NONINVERT_IO0;
      break;
  }

  /* Configure CSR bits: functional mode, power mode, speed mode, configuration mode, inputs */
  LL_OPAMP_SetConfig(p_instance,
                     LL_OPAMP_MODE_FUNCTIONAL
                     | (inverting_input)
                     | (non_inverting_input)
                     | (uint32_t)(p_config->speed_mode)
                     | (uint32_t)(p_config->configuration_mode)
                     | (uint32_t)(p_config->opamp_output)
                    );

  return HAL_OK;
}

/**
  * @brief  Return the configuration parameters of the OPAMP peripheral
  *         in the hal_opamp_config_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config The configuration parameters.
  */
void HAL_OPAMP_GetConfig(const hal_opamp_handle_t *hopamp, hal_opamp_config_t *p_config)
{
  const OPAMP_TypeDef *p_instance;
  uint32_t reg_value;

