MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* Fill config structure parameter */
  reg_value = LL_OPAMP_GetConfig(p_instance);

  p_config->speed_mode  = (hal_opamp_speed_mode_t)((uint32_t)(reg_value & (OPAMP_CSR_OPAHSM)));
  p_config->opamp_output  = (hal_opamp_out_connection_t)((uint32_t)(reg_value & (OPAMP_CSR_OPAINTOEN)));
  p_config->configuration_mode = (hal_opamp_config_mode_t)(((reg_value & OPAMP_CSR_VM_SEL_1) == 0UL)
                                                           ? (uint32_t)(LL_OPAMP_MODE_STANDALONE)
                                                           : (uint32_t)(reg_value & OPAMP_CSR_VM_SEL));
}

/**
  * @brief  Reset the configuration parameters of the OPAMP peripheral.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @note   Configuration parameters of the OPAMP are reset to:
  *         + OPAMP is disabled
  *         + normal mode operation (i.e.: not in calibration mode)
  *         + normal power mode
  *         + normal speed mode
  *         + standalone configuration
  *         + PGA gain x2
  *         + GPIO connected to non-inverting input
  *         + GPIO connected to inverting input
  */
void  HAL_OPAMP_ResetConfig(hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  ASSERT_DBG_STATE(hopamp->global_state, ((uint32_t)HAL_OPAMP_STATE_IDLE));

  LL_OPAMP_Disable(p_instance);

  /* Set some CSR bits to reset value */
  /* Mind that CSR RANGE bit of OPAMP remains unchanged (applies to both OPAMPs) */
  LL_OPAMP_ResetConfig(p_instance);
}

/**
  * @brief  Run the self calibration of one OPAMP according to power mode.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  power_mode On this series, the only available value is HAL_OPAMP_POWER_MODE_NORMAL
  * @note   At the end of calibration offset trimming values (PMOS & NMOS) are updated,
  *         user trimming is enabled, and the initial configuration mode is restored.
  * @note   Calibration runs about 10 ms (5 dichotomy steps, repeated for P
  *         and N transistors: 10 steps with 1 ms for each step).
  * @retval HAL_OK OPAMP Instance calibration has been correctly done.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  * @retval HAL_BUSY If the define USE_HAL_CHECK_PROCESS_STATE is set to "1" and the current state doesn't match
  *                  HAL_OPAMP_STATE_IDLE.
  */
hal_status_t HAL_OPAMP_Calibrate(hal_opamp_handle_t *hopamp, hal_opamp_power_mode_t power_mode)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_POWER_MODE(power_mode));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hopamp == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hopamp, global_state, HAL_OPAMP_STATE_IDLE, HAL_OPAMP_STATE_CALIB);

  OPAMP_CalibrateSingle(hopamp, power_mode); /* Calibration for a single OPAMP instance */

  hopamp->global_state = HAL_OPAMP_STATE_IDLE;

  return status;
}

/**
  * @brief  Set the OPAMP peripheral offset trimming values according to the specified parameters in
  *         the hal_opamp_trimming_config_t, for normal-power or low-power mode.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config  The offset trimming configuration that contains information for the specified OPAMP.
  * @param  power_mode Normal-power or low-power mode.
  * @retval HAL_OK OPAMP Instance offset trimming has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL
  */
hal_status_t HAL_OPAMP_SetConfigTrimming(const hal_opamp_handle_t *hopamp,
                                         const hal_opamp_trimming_offset_pair_t *p_config,
                                         hal_opamp_power_mode_t power_mode)
{
  OPAMP_TypeDef *p_instance;
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_POWER_MODE(power_mode));

  ASSERT_DBG_PARAM(IS_OPAMP_TRIMMING_VALUE(p_config->trim_offset_p));
  ASSERT_DBG_PARAM(IS_OPAMP_TRIMMING_VALUE(p_config->trim_offset_n));

  ASSERT_DBG_STATE(hopamp->global_state, HAL_OPAMP_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* Set user calibration mode */
  LL_OPAMP_SetTrimmingMode(p_instance, LL_OPAMP_TRIMMING_USER);

  /* Set values for transistors differential pair high (PMOS) and low (NMOS) */
  LL_OPAMP_SetOffsetTrimAllValue(p_instance, (uint32_t) power_mode, p_config->trim_offset_p, p_config->trim_offset_n);

  return status;
}

/**
  * @brief  Get the OPAMP peripheral offset trimming values for normal-power or low-power mode.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config The retrieved offset trimming values that contain information for the specified OPAMP.
  * @param  power_mode On this series, the only available value is HAL_OPAMP_POWER_MODE_NORMAL
  * @note   Careful: to retrieve the factory offset trimming pairs, this function must be called when
  *         OPAMP trimming_mode is still set to trimming factory,
  *         this means before:
  *          - OPAMP calibration process,
  *            (call of HAL_OPAMP_Calibrate()),
  *          - and before a user trimming has been set,
  *            (call of HAL_OPAMP_SetConfigTrimming()),
  *         Otherwise, the user trimming values are retrieved.
  */
void HAL_OPAMP_GetConfigTrimming(const hal_opamp_handle_t *hopamp,
                                 hal_opamp_trimming_offset_pair_t *p_config,
                                 hal_opamp_power_mode_t power_mode)
{
  const OPAMP_TypeDef *p_instance;

