MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_POWER_MODE(power_mode));

  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  p_config->trim_offset_n = LL_OPAMP_GetOffsetTrimValue(p_instance, (uint32_t)power_mode, LL_OPAMP_TRIMMING_NMOS);
  p_config->trim_offset_p = LL_OPAMP_GetOffsetTrimValue(p_instance, (uint32_t)power_mode, LL_OPAMP_TRIMMING_PMOS);
}

/**
  * @brief  Get the user trimming mode for OPAMP peripheral.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OPAMP_TRIMMING_MODE_FACTORY If this function has been called before:
  *          - OPAMP calibration process, (call of HAL_OPAMP_Calibrate() or HAL_OPAMP_CalibrateParallel()),
  *          - and before a user trimming has been set, (call of HAL_OPAMP_SetConfigTrimming()).
  * @retval HAL_OPAMP_TRIMMING_MODE_USER After a call to one of the above functions.
  */
hal_opamp_trimming_mode_t HAL_OPAMP_GetTrimmingMode(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_trimming_mode_t trimming_mode;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  trimming_mode = (hal_opamp_trimming_mode_t) LL_OPAMP_GetTrimmingMode(p_instance);

  return trimming_mode;
}

/**
  * @}
  */

/** @addtogroup OPAMP_Exported_Functions_Group2
  * @{
    This section provides functions allowing to:
      + start the OPAMP,
      + stop  the OPAMP.
  */

/**
  * @brief  Start the OPAMP.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OK
  */
hal_status_t HAL_OPAMP_Start(hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, HAL_OPAMP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hopamp, global_state, HAL_OPAMP_STATE_IDLE, HAL_OPAMP_STATE_ACTIVE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_Enable(p_instance);

  return HAL_OK;
}

/**
  * @brief  Stop the OPAMP.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OK
  */
hal_status_t HAL_OPAMP_Stop(hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, HAL_OPAMP_STATE_ACTIVE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_Disable(p_instance);

  hopamp->global_state = HAL_OPAMP_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup OPAMP_Exported_Functions_Group3
  * @{
    This section provides functions allowing to set and control the OPAMP main features:
      + the configuration of input connection,
      + the Programmable Gain Amplifier gain.
  */

/**
  * @brief  Configure input connection of the OPAMP peripheral according to
  *         the specified parameters in the hal_opamp_config_input_connection_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config The configuration that contains input connections for the specified OPAMP.
  * @retval HAL_OK OPAMP Instance input connections has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL.
  */
hal_status_t HAL_OPAMP_SetConfigInputConnection(const hal_opamp_handle_t *hopamp,
                                                const hal_opamp_config_input_connection_t *p_config)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_OPAMP_NON_INVERTING_INPUT(p_config->non_inverting_input));

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  uint32_t configuration_mode;
  configuration_mode = LL_OPAMP_GetConfigurationMode(p_instance);
#if defined(USE_ASSERT_DBG_PARAM)
  /* Check inputs compliant with configuration mode */
  if (configuration_mode == LL_OPAMP_MODE_PGA)
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_PGA(p_config->inverting_input));
  }
  else if (configuration_mode == LL_OPAMP_MODE_STANDALONE)
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_STANDALONE(p_config->inverting_input));
  }
  else /* (configuration_mode == LL_OPAMP_MODE_FOLLOWER) */
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_FOLLOWER(p_config->inverting_input));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  /* Set OPAMP inputs connections */
  if (configuration_mode != LL_OPAMP_MODE_STANDALONE)
  {
    /* Mode follower or PGA: keep inverting input configuration set by @ref HAL_OPAMP_SetConfig() */
    LL_OPAMP_SetInputNonInverting(p_instance, (uint32_t)p_config->non_inverting_input);
  }
  else
  {
    LL_OPAMP_SetInputs(p_instance, (uint32_t)p_config->non_inverting_input, (uint32_t)p_config->inverting_input);
  }


  return HAL_OK;
}

/**
  * @brief  Get the input connection of the OPAMP peripheral.
  *         the specified parameters in the hal_opamp_config_input_connection_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config Structure that contains input connection for the specified OPAMP.
  */
void HAL_OPAMP_GetConfigInputConnection(const hal_opamp_handle_t *hopamp,
                                        hal_opamp_config_input_connection_t *p_config)
{
  OPAMP_TypeDef *p_instance;
  uint32_t vp_vm_inputs;
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  vp_vm_inputs = LL_OPAMP_GetInputs(p_instance);

  /* Manage internal connection setting (follower, PGA) */
  if (((uint32_t)(vp_vm_inputs & OPAMP_CSR_VM_SEL)) == LL_OPAMP_INPUT_INVERT_INT_PGA)
  {
    vp_vm_inputs |= LL_OPAMP_INPUT_INVERT_INT_FOLLOWER;
  }

  p_config->inverting_input     = (hal_opamp_inverting_input_t)((uint32_t)(vp_vm_inputs & OPAMP_CSR_VM_SEL));
  p_config->non_inverting_input = (hal_opamp_non_inverting_input_t)((uint32_t)(vp_vm_inputs & OPAMP_CSR_VP_SEL));
}

/**
  * @brief  Set the PGA gain to be used when the OPAMP is configured in Programmable Gain Amplifier (OPAMP_PGA_MODE).
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  gain specifies the gain (x2, x4, x8 or x16) in PGA mode
  * @retval HAL_OK  The PGA gain has been correctly set.
  * @retval HAL_ERROR If a parameter is invalid.
  */
hal_status_t HAL_OPAMP_SetGain(const hal_opamp_handle_t *hopamp, hal_opamp_pga_gain_t gain)
{
  OPAMP_TypeDef *p_instance;

