MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_PGA_GAIN(gain));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_SetPGAGain(p_instance, (uint32_t) gain);

  return HAL_OK;
}

/**
  * @brief  Get the PGA gain used when the OPAMP is configured in Programmable Gain Amplifier (OPAMP_PGA_MODE).
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OPAMP_PGA_GAIN_2   When PGA gain is x2.
  * @retval HAL_OPAMP_PGA_GAIN_4   When PGA gain is x4.
  * @retval HAL_OPAMP_PGA_GAIN_8   When PGA gain is x8.
  * @retval HAL_OPAMP_PGA_GAIN_16  When PGA gain is x16.
  */
hal_opamp_pga_gain_t HAL_OPAMP_GetGain(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_pga_gain_t gain;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  gain = (hal_opamp_pga_gain_t) LL_OPAMP_GetPGAGain(p_instance);
  return gain;
}

/**
  * @brief Set OPAMP PGA external connection configuration.
  * @param hopamp Pointer to a hal_opamp_handle_t structure
  * @param external_mode This parameter can be one of the following values:
  *         @arg @ref HAL_OPAMP_PGA_EXT_NONE
  *         @arg @ref HAL_OPAMP_PGA_EXT_FILT
  *         @arg @ref HAL_OPAMP_PGA_EXT_BIAS
  *         @arg @ref HAL_OPAMP_PGA_EXT_BIAS_FILT
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref HAL_OPAMP_SetConfig().
  * @retval HAL_OK  PGA external connection configuration has been correctly set.
  * @retval HAL_ERROR If a parameter is invalid.
  */
hal_status_t HAL_OPAMP_SetPGAExternalMode(const hal_opamp_handle_t *hopamp, hal_opamp_pga_external_t external_mode)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_PGA_EXTERNAL_MODE(external_mode));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_SetPGAExternalMode(p_instance, (uint32_t) external_mode);

  return HAL_OK;
}

/**
  * @brief Get OPAMP PGA external connection configuration.
  * @param hopamp Pointer to a hal_opamp_handle_t structure
  * @retval value of type hal_opamp_pga_external_t
  */
hal_opamp_pga_external_t HAL_OPAMP_GetPGAExternalMode(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_pga_external_t external_mode;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  external_mode = (hal_opamp_pga_external_t) LL_OPAMP_GetPGAExternalMode(p_instance);
  return external_mode;
}


/**
  * @brief  Configure the OPAMP peripheral mode according to the specified parameters in the hal_opamp_config_t,
  *         in timer-controlled mode for secondary configuration.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  configuration_mode Value of type hal_opamp_config_mode_t
  * @retval HAL_OK OPAMP Instance has been correctly configured.
  * @retval HAL_ERROR Configuration error
  * @note   Timer-controlled secondary mode has constraints from timer-controlled primary mode,
  *         therefore function @ref HAL_OPAMP_SetConfig() must be called prior to this function.
  */
hal_status_t HAL_OPAMP_SetConfigModeMuxSecondary(hal_opamp_handle_t *hopamp,
                                                 hal_opamp_config_mode_t configuration_mode)
{
  hal_status_t status = HAL_OK;
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_CONFIGURATION_MODE(configuration_mode));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* Timer-controlled mode primary and secondary configuration mode constraints:
     Both must be in standalone mode or follower/PGA */
  uint32_t primary_configuration_mode;
  primary_configuration_mode = LL_OPAMP_GetConfigurationMode(p_instance);

  /* Manage configuration error cases */
  if (configuration_mode == HAL_OPAMP_MODE_STANDALONE)
  {
    if (primary_configuration_mode != LL_OPAMP_MODE_STANDALONE)
    {
      status = HAL_ERROR;
    }
  }
  else /* (configuration_mode == HAL_OPAMP_MODE_FOLLOWER) || (configuration_mode == HAL_OPAMP_MODE_PGA) */
  {
    if (primary_configuration_mode == LL_OPAMP_MODE_STANDALONE)
    {
      status = HAL_ERROR;
    }
  }

  /* Configure secondary OPAMP mode
    - case HAL_OPAMP_MODE_FOLLOWER or HAL_OPAMP_MODE_PGA: configuration performed accordingly
    - case HAL_OPAMP_MODE_STANDALONE: no action needed, inverting input update done
      by @ref HAL_OPAMP_SetConfigInputMuxSecondaryConnection()
  */
  if (configuration_mode != HAL_OPAMP_MODE_STANDALONE)
  {
    if (primary_configuration_mode == LL_OPAMP_MODE_PGA)
    {
      LL_OPAMP_SetInputMuxInvertingSecondary(p_instance, LL_OPAMP_INPUT_INVERT_INT_PGA);
    }
    else
    {
      LL_OPAMP_SetInputMuxInvertingSecondary(p_instance, LL_OPAMP_INPUT_INVERT_INT_FOLLOWER);
    }
  }

  return status;
}

/**
  * @brief  Return the configuration parameters of the OPAMP peripheral mode in the hal_opamp_config_t,
  *         in timer-controlled mode for secondary configuration.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval value of type hal_opamp_config_mode_t
  */
hal_opamp_config_mode_t HAL_OPAMP_GetConfigModeMuxSecondary(const hal_opamp_handle_t *hopamp)
{
  const OPAMP_TypeDef *p_instance;
  hal_opamp_config_mode_t configuration_mode;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* Timer-controlled mode primary and secondary configuration mode constraints:
     Both must be in standalone mode or follower/PGA */
  uint32_t primary_configuration_mode;
  primary_configuration_mode = LL_OPAMP_GetConfigurationMode(p_instance);

  if (primary_configuration_mode == LL_OPAMP_MODE_STANDALONE)
  {
    configuration_mode = HAL_OPAMP_MODE_STANDALONE;
  }
  else
  {
    if (LL_OPAMP_GetInputMuxInvertingSecondary(p_instance) == LL_OPAMP_INPUT_INVERT_INT_PGA)
    {
      configuration_mode = HAL_OPAMP_MODE_PGA;
    }
    else
    {
      configuration_mode = HAL_OPAMP_MODE_FOLLOWER;
    }
  }

  return configuration_mode;
}

/**
  * @brief  Configure input secondary connection of the OPAMP peripheral according to
  *         the specified parameters in the hal_opamp_config_input_connection_t,
  *         in timer-controlled mode for secondary configuration.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  p_config The configuration that contains input secondary connections for the specified OPAMP.
  * @retval HAL_OK OPAMP Instance input secondary connections has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL.
  */
hal_status_t HAL_OPAMP_SetConfigInputMuxSecondaryConnection(const hal_opamp_handle_t *hopamp,
                                                            const hal_opamp_config_input_connection_t *p_config)
{
  OPAMP_TypeDef *p_instance;

