MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_OPAMP_NON_INVERTING_INPUT(p_config->non_inverting_input));

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  uint32_t configuration_mode;
  configuration_mode = LL_OPAMP_GetConfigurationMode(p_instance);
#if defined(USE_ASSERT_DBG_PARAM)
  /* Check inputs compliant with configuration mode */
  if (configuration_mode == LL_OPAMP_MODE_PGA)
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_PGA(p_config->inverting_input));
  }
  else if (configuration_mode == LL_OPAMP_MODE_STANDALONE)
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_STANDALONE(p_config->inverting_input));
  }
  else /* (configuration_mode == LL_OPAMP_MODE_FOLLOWER) */
  {
    ASSERT_DBG_PARAM(IS_OPAMP_INVERTING_INPUT_FOLLOWER(p_config->inverting_input));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  /* Set OPAMP inputs connections */
  if (configuration_mode != LL_OPAMP_MODE_STANDALONE)
  {
    /* Mode follower or PGA: keep inverting input configuration set by @ref HAL_OPAMP_SetConfigMuxSecondary() */
    LL_OPAMP_SetInputMuxNonInvertingSecondary(p_instance, (uint32_t)p_config->non_inverting_input);
  }
  else
  {
    LL_OPAMP_SetInputsMuxSecondary(p_instance,
                                   (uint32_t)p_config->non_inverting_input, (uint32_t)p_config->inverting_input);
  }

  return HAL_OK;
}

/**
  * @brief  Set the PGA secondary gain to be used when the OPAMP is configured in Programmable Gain Amplifier (PGA),
  *         in timer-controlled mode for secondary configuration.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  gain specifies the gain (x2, x4, x8, x16, x-1, x-3 ,x-7 or x-15) in PGA mode
  * @retval HAL_OK  The PGA gain has been correctly set.
  * @retval HAL_ERROR If a parameter is invalid.
  */
hal_status_t HAL_OPAMP_SetPGAGainMuxSecondary(const hal_opamp_handle_t *hopamp, hal_opamp_pga_gain_t gain)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_PGA_GAIN(gain));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_SetPGAGainMuxSecondary(p_instance, (uint32_t) gain);

  return HAL_OK;
}

/**
  * @brief  Get the PGA gain used when the OPAMP is configured in Programmable Gain Amplifier (PGA),
  *         in timer-controlled mode for secondary configuration.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OPAMP_PGA_GAIN_2              When PGA gain is x2.
  * @retval HAL_OPAMP_PGA_GAIN_4              When PGA gain is x4.
  * @retval HAL_OPAMP_PGA_GAIN_8              When PGA gain is x8.
  * @retval HAL_OPAMP_PGA_GAIN_16             When PGA gain is x16.
  * @retval HAL_OPAMP_PGA_GAIN_2_OR_MINUS_1   When PGA gain is x2 or x-1.
  * @retval HAL_OPAMP_PGA_GAIN_4_OR_MINUS_3   When PGA gain is x4 or x-3.
  * @retval HAL_OPAMP_PGA_GAIN_8_OR_MINUS_7   When PGA gain is x8 or x-7.
  * @retval HAL_OPAMP_PGA_GAIN_16_OR_MINUS_15 When PGA gain is x16 or x-15.
  */
hal_opamp_pga_gain_t HAL_OPAMP_GetPGAGainMuxSecondary(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_pga_gain_t gain_secondary;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  gain_secondary = (hal_opamp_pga_gain_t) LL_OPAMP_GetPGAGainMuxSecondary(p_instance);

  return gain_secondary;
}

/**
  * @brief  Set the Timer signal selection for OPAMP input control.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  mux_inputs_ctrl The configuration that contains input connections for the specified OPAMP.
  * @retval HAL_OK OPAMP Instance input connections has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL.
  */
hal_status_t HAL_OPAMP_SetMuxInputCtrl(const hal_opamp_handle_t *hopamp, hal_opamp_mux_inputs_ctrl_t mux_inputs_ctrl)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_MUX_INPUT_CTRL(mux_inputs_ctrl));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_SetMuxInputCtrl(p_instance, (uint32_t)mux_inputs_ctrl);

  return HAL_OK;
}

/**
  * @brief  Get the Timer signal selection for OPAMP input control
  *         the specified parameters in the hal_opamp_mux_inputs_ctrl_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval value of type hal_opamp_mux_inputs_ctrl_t
  */
hal_opamp_mux_inputs_ctrl_t HAL_OPAMP_GetMuxInputCtrl(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_mux_inputs_ctrl_t mux_inputs_ctrl;

  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  mux_inputs_ctrl = (hal_opamp_mux_inputs_ctrl_t) LL_OPAMP_GetMuxInputCtrl(p_instance);

  return mux_inputs_ctrl;
}

/**
  * @brief  Set the Timer signal selection for OPAMP PGA gain selection.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @param  mux_pga_ctrl The configuration that contains pga mode selection for the specified OPAMP.
  * @retval HAL_OK OPAMP Instance input connections has been correctly configured.
  * @retval HAL_INVALID_PARAM If p_config is NULL.
  */
hal_status_t HAL_OPAMP_SetMuxPGAGainCtrl(const hal_opamp_handle_t *hopamp, hal_opamp_mux_pga_ctrl_tim_t mux_pga_ctrl)
{
  OPAMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_PARAM(IS_OPAMP_MUX_PGA_GAIN_CTRL(mux_pga_ctrl));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)HAL_OPAMP_STATE_IDLE);

  p_instance = OPAMP_GET_INSTANCE(hopamp);
  LL_OPAMP_SetMuxPGAGainCtrl(p_instance, (uint32_t)mux_pga_ctrl);

  return HAL_OK;
}

/**
  * @brief  Get the Timer signal selection for OPAMP input control
  *         the specified parameters in the hal_opamp_mux_pga_ctrl_tim_t.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval value of type hal_opamp_mux_pga_ctrl_tim_t
  */
hal_opamp_mux_pga_ctrl_tim_t HAL_OPAMP_GetMuxPGAGainCtrl(const hal_opamp_handle_t *hopamp)
{
  OPAMP_TypeDef *p_instance;
  hal_opamp_mux_pga_ctrl_tim_t mux_pga_ctrl;

