MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_opamp.c
  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  mux_pga_ctrl = (hal_opamp_mux_pga_ctrl_tim_t) LL_OPAMP_GetMuxPGAGainCtrl(p_instance);

  return mux_pga_ctrl;
}
/**
  * @}
  */

/** @addtogroup OPAMP_Exported_Functions_Group4
  * @{
    This subsection permits to get in run-time the status of the peripheral:
      + retrieve the HAL OPAMP handle state.
  */

/**
  * @brief  Return the OPAMP handle state.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure.
  * @retval HAL_OPAMP_STATE_RESET   If OPAMP not yet initialized or is de-initialized.
  * @retval HAL_OPAMP_STATE_IDLE    If OPAMP is initialized.
  * @retval HAL_OPAMP_STATE_CALIB   If OPAMP is being calibrated.
  * @retval HAL_OPAMP_STATE_ACTIVE  If OPAMP is active.
  */
hal_opamp_state_t HAL_OPAMP_GetState(const hal_opamp_handle_t *hopamp)
{
  ASSERT_DBG_PARAM((hopamp != NULL));

  ASSERT_DBG_STATE(hopamp->global_state, (uint32_t)OPAMP_STATE_ALL);

  return hopamp->global_state;
}

/**
  * @}
  */

/** @addtogroup OPAMP_Exported_Functions_Group6
  * @{
    This subsection provides functions allowing to:
      + set a user data pointer (ex: a user context) in a OPAMP handle,
      + get a user data pointer (ex: a user context) from a OPAMP handle.
    @note A typical usage is to set user data pointer before starting an OPAMP,<br>
          then retrieve it when needed.
  */
#if defined(USE_HAL_OPAMP_USER_DATA) && (USE_HAL_OPAMP_USER_DATA == 1)
/**
  * @brief  Store user data pointer into the OPAMP handle.
  * @param  hopamp Pointer to a hal_opamp_handle_t.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_OPAMP_SetUserData(hal_opamp_handle_t *hopamp, const void *p_user_data)
{
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  hopamp->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve user data pointer from the OPAMP handle.
  * @param  hopamp Pointer to a hal_opamp_handle_t.
  * @retval (void*) The pointer to the user data, when previously set by HAL_OPAMP_SetUserData().
  * @retval NULL Other way.
  */
const void *HAL_OPAMP_GetUserData(const hal_opamp_handle_t *hopamp)
{
  ASSERT_DBG_PARAM((hopamp != NULL));
  ASSERT_DBG_STATE(hopamp->global_state, OPAMP_STATE_ALL);

  return (hopamp->p_user_data);
}
#endif /* USE_HAL_OPAMP_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup OPAMP_Private_Functions
  * @{
  */

/**
  * @brief  Run the self calibration for a single OPAMP instance according to the specified power mode.
  * @param  hopamp Pointer to a hal_opamp_handle_t structure of OPAMP to be calibrated.
  * @param  power_mode Low_power or normal_power.
  * @note   Trimming values (PMOS & NMOS) are updated and user trimming is
  *         enabled whenever calibration is successful.
  * @note   Calibration runs about 10 ms (5 dichotomy steps, repeated for P
  *         and N transistors: 10 steps with 1 ms for each step).
  */
static void OPAMP_CalibrateSingle(hal_opamp_handle_t *hopamp, hal_opamp_power_mode_t power_mode)
{
  OPAMP_TypeDef *p_instance;
  uint32_t memo_opamp_mode;
  uint32_t memo_opamp_output;
  uint32_t trim_value;
  uint32_t diff_pair;
  uint32_t delta;

  p_instance = OPAMP_GET_INSTANCE(hopamp);

  /* At first save OPAMP configuration mode and output connection */
  memo_opamp_mode = LL_OPAMP_GetConfigurationMode(p_instance);
  memo_opamp_output = LL_OPAMP_GetOutputConnection(p_instance);

  /* Then change OPAMP configuration mode (because calibration processing is not working in PGA mode) */
  /* Use the standalone mode */
  LL_OPAMP_SetConfigurationMode(p_instance, LL_OPAMP_MODE_STANDALONE);

  /* During the calibration loop execution, the OPAMP output connection must be external */
  LL_OPAMP_SetOutputConnection(p_instance, LL_OPAMP_OUTPUT_CONNECT_EXTERNAL);

  /*  User trimming values are used for offset calibration */
  LL_OPAMP_SetTrimmingMode(p_instance, LL_OPAMP_TRIMMING_USER);

  for (uint32_t loop = 0U ; loop < 2U; loop++) /* Value "2": iterations for transistors NMOS and PMOS */
  {
    if (loop == 0U)
    {
      diff_pair = LL_OPAMP_TRIMMING_NMOS;  /* 1st calibration - N */
    }
    else
    {
      diff_pair = LL_OPAMP_TRIMMING_PMOS;  /* 2nd calibration - P */
    }

    /* Enable calibration */
    LL_OPAMP_SetMode(p_instance, LL_OPAMP_MODE_CALIBRATION);

    LL_OPAMP_SetCalibrationSelection(p_instance, diff_pair); /* calibration N or P */

    LL_OPAMP_Enable(p_instance);

    /* Init trimming value : to medium value */
    trim_value = 16U;

    delta = 8U; /* Value "8": midpoint of 16 bits calibration factor range */
    while (delta != 0U)
    {
      /* Set candidate trimming value in the register depending of power mode (OTR or LPOTR) */
      LL_OPAMP_SetOffsetTrimValue(p_instance, (uint32_t)power_mode, diff_pair, trim_value);

      /* Wait 1 ms delay as per datasheet (electrical characteristics). */
      /* Offset trim time: during calibration, minimum time needed between */
      /* two steps to have 1 mV accuracy. */
      HAL_Delay(OPAMP_TRIMMING_DELAY_MS);

      /* Check CALOUT CSR bit value */
      if (LL_OPAMP_IsCalibrationOutputSet(p_instance) == 1U)
      {
        /* OPAMP_CSR_CALOUT is HIGH try lower trimming */
        trim_value -= delta;
      }
      else
      {
        /* OPAMP_CSR_CALOUT is LOW try higher trimming */
        trim_value += delta;
      }

      /* Divide range by 2 to continue dichotomy sweep */
      delta >>= 1U;
    }

    /* Still need to check if right calibration is current value or one step below */
    /* Set candidate trimming */
    LL_OPAMP_SetOffsetTrimValue(p_instance, (uint32_t)power_mode, diff_pair, trim_value);

    /* Wait 1 ms delay as per datasheet (electrical characteristics). */
    /* Offset trim time: during calibration, minimum time needed between */
    /* two steps to have 1 mV accuracy. */
    HAL_Delay(OPAMP_TRIMMING_DELAY_MS);

    if (LL_OPAMP_IsCalibrationOutputSet(p_instance) == 0U)
    {
      /* Trimming value is actually one value more */
      trim_value++;
      LL_OPAMP_SetOffsetTrimValue(p_instance, (uint32_t)power_mode, diff_pair, trim_value);
    }
  } /* end for(loop) */

  /* Disable the OPAMPs */
  LL_OPAMP_Disable(p_instance);
  /* Reset calibration selection to NMOS */
  LL_OPAMP_SetCalibrationSelection(p_instance, LL_OPAMP_TRIMMING_NMOS);
  /* Disable calibration */
  LL_OPAMP_SetMode(p_instance, LL_OPAMP_MODE_FUNCTIONAL);

  /* Restore OPAMP mode and output connection after calibration */
  LL_OPAMP_SetConfigurationMode(p_instance, memo_opamp_mode);
  LL_OPAMP_SetOutputConnection(p_instance, memo_opamp_output);
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_OPAMP_MODULE */
#endif /* OPAMP1 || OPAMP2 || OPAMP3 */
/**
  * @}
  */
